{"meta":{"title":"doradolive","subtitle":"","description":"运筹帷幄之中，决胜于千里之外。","author":"Olivezq","url":"https://Olivezq.github.io","root":"/"},"pages":[{"title":"About","date":"2021-12-24T03:58:14.000Z","updated":"2021-12-25T14:41:06.901Z","comments":true,"path":"about/index.html","permalink":"https://olivezq.github.io/about/index.html","excerpt":"","text":"About the author: Hello world! Actually there’s no much thing to talk about. But anyway. My name is Olive and this is my first personal site. I was born in 2006, an urban child. In 2021, I graduated from The Second Yu Ying Foreign Languages School of Nanjing and started my life in Jinling High School International Department A-Level Centre. Well that’s quite both two long names. I am a 70% INTJ and 30% ENTJ, according to MBTI. I am also a slytherclaw(both Slytherin and Ravenclaw). The reason I call this site “doradolive” is that it contains two names: dorado and olive. Dorado is a Spanish word meaning “golden”, also acts as a name for a marine fish with silver and bright blue coloration when alive. I also considered calling this site “ocellradolive” but that seemed too much. I took interest in Mathematics, Chinese, Economics, Computer Science and Linguistics. I’ll update this page if I want to change anything but for now, that’s all. Welcome. About the site: This site includes three parts and these parts are named under the name of “categories”. The first category is “Life”. It’s about my personal experiences, like some competitions I take part in, school life and a little bit of fiction writing. The second category is “IGCSE”. In this part, I updated several IGCSE subjects’s theory in a Chinese version, to make every Chinese students who study IGCSE have a better understanding of these subjects. I may also update videos, depending on my leisure time. The third category is “Becoming Rational”. I come up with thoughts about rationality and some philosophical point from time to time, so recording these thoughts needs to become a habbit so I can see whether I have improved. Some researches and investigations I did will also be updated here. All the posts are owned by me. Including the “IGCSE” category, because I made all the summaries and notes and videos and updates by myself. The whole site belongs to GitHub and Hexo and me, because GitHub and Hexo provide a site to be built, and I build this site all by myself. Welcome."},{"title":"categories","date":"2021-12-24T05:11:45.000Z","updated":"2021-12-24T05:14:08.309Z","comments":true,"path":"categories/index.html","permalink":"https://olivezq.github.io/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2021-12-24T05:17:47.000Z","updated":"2021-12-24T05:28:56.776Z","comments":true,"path":"tags/index.html","permalink":"https://olivezq.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"2021 Remix","slug":"2021-Remix","date":"2022-01-09T07:51:07.000Z","updated":"2022-01-09T08:01:13.096Z","comments":true,"path":"2022/01/09/2021-Remix/","link":"","permalink":"https://olivezq.github.io/2022/01/09/2021-Remix/","excerpt":"","text":"2021 Remix “是不是生活太艰难，还是活色生香。我们都遍体鳞伤，也慢慢坏了心肠。”– 朴树《清白之年》 The song above happened to be one of the readings in a Moke Chinese Exam of a district in our city. Either in Gulou or Qinhuai, I don’t quite remember.When Mr. Yang was illustrating this reading, I saw my deskmate wrote the lyric high at the top of the paper.I asked him why, and he shook his head.But that sentence, which generally means “Is life too hard, or live fresh. We were all bruised, and ill-disposed.”in English, was deeply branded in my mind ever since. Because it was so beautiful and real. Sun was just shinning bright as usual and we were having our precious PE lessons. That was when I started to feel sad as I lied down on a pad and looked up at the heavy shades of the tree leaves.I thought about leaving. Leaving this school which I had stayed in for three years, leaving the life I was accustomed to. The last week in my secondary school, I took a digital record pen along with me. Trying to record everything that would eventually leave me.I recorded the wind, the chats, the flood when everyone was rushing towards the school canteen, the tones and intonations of the teachers. Sometimes the rain, the noises of fans, the drop of a pen, the fall down of a pile of books. Even the laughters, the silence. We said goodbye. Almost everyone, Claire, Kevin, Vincent, Apple, Alice, Sun, Laura, Chloe, Cousins, Brian… The leaving still came and I graduated from secondary school. But another story has only just begun. Looking back at last year, I will use “leave” to describe 2021 if I can only use one word. In this year, I graduated, I experienced my best summer holiday ever, I went to an international department, I built up this site, I met new friends. Rewinding and reconsidering, 2021 seemed so unusual.In 2017, I graduated from primary school. It was a dark period of my life and I was very fortunate to come to my secondary school at that time. The journal I kept in 2017 was still in my wardrobe, written my thoughts in ink. Now, I still keep a journal and everytime I review it, I saw times different from those in 2017.But that doesn’t mean 2021 is a totally-happy year. We experienced COVID-19 period and had our final exam which had a decisive influence on our future. We had a lot of pressure, suffered pain. I didn’t go to NFLS as I expected. Time passed fast, like the stream touched across my palm when I washed my hand on the last day of 2021. As the lyric said at the beginning of this remix.Life is hard. You suffered a lot to get used to it. You may get cynical, you may get heart-broken. But as long as you insist on living, accept changes, life is live.","categories":[{"name":"Life","slug":"Life","permalink":"https://olivezq.github.io/categories/Life/"}],"tags":[{"name":"2021","slug":"2021","permalink":"https://olivezq.github.io/tags/2021/"},{"name":"Experience","slug":"Experience","permalink":"https://olivezq.github.io/tags/Experience/"},{"name":"Summary","slug":"Summary","permalink":"https://olivezq.github.io/tags/Summary/"}]},{"title":"IGCSE Physics Theory（中文版)","slug":"IGCSE-Physics-Theory（中文版","date":"2021-12-25T06:53:31.000Z","updated":"2021-12-30T13:02:14.248Z","comments":true,"path":"2021/12/25/IGCSE-Physics-Theory（中文版/","link":"","permalink":"https://olivezq.github.io/2021/12/25/IGCSE-Physics-Theory%EF%BC%88%E4%B8%AD%E6%96%87%E7%89%88/","excerpt":"","text":"一些备用知识点 国际单位：m, kg, s, A, K, mol, cd 牛顿运动定律 Chapter 1 Making Measurements1.1 length&amp;volume 测量工具：1） ruler 尺子 （e.g. metre ruler)测量注意点：（以wire为例）【4步】 straight，laid closely alongside end: cut neatly/ragged line one end of the wire up against the “0” look at the other end and read一定要注意测出来的是否可以保证正确2）游标卡尺 螺旋测微器游标：L=整的毫米数（主尺）+0.1*n毫米（游标） 测量方法1）measure sth. thin以测纸的厚度为例：【3步】 take a stack of 500 sheets measure its thickness devide by 5002）measure sth. curved以测弯曲的铁条为例：【3步】 lay a thread along the line mark the thread at either end lay it along a ruler3）measuring volumesi. cube/cuboid【3要素】 length width height=multiplyother regular shapes(spheres…):look up the equation for the volume ii. liquidsmeasuring cylinder 量筒beaker 烧杯look at the scale horizontally and read the level of the bottom of the meniscus(简单表达：eyes level with the scale)用最合适的量筒。e.g. 你不能用5ml的量筒测10mliii. measure bu displacement (for irregular objects) 【6步】 select a cylinder 3 or 4 times bigger than the object fill in water note V1 immerse the object in the water note V2 Vobject=V2-V1 国际单位：SI units：metre（m)1l=1dm^3 1ml=1cm^31deci(dm): 0.1m 1centi(cm):0.01m1mili(mm):0.001m 1micro(um):0.000001m1kilo~(km):1000m 1.2 Density 公式：Density (ρ)=Mass (m)/Volume (V)做题时m和V两个要素缺一不可 SI units: kg/m^3 密度的性质：1）Gas&lt;solid/liquid2）任何在水面漂浮的物体密度都比水小。（e.g.冰）3）许多物质都有不同的密度（e.g.木头）4）水的密度：1*10^3kg/m^3, 1g/cm^35）immicible不溶中最上层的液体密度最小 1.3 Measuring Time 测量工具：analogue(指针）clockdigital(数字）clock (most precise） 测量方法：测量短时间：e.g.plumb bob单摆方法同1.1的2.1）相似 本章注意点 单位换算 各种物质的密度大小 特殊物体的m/v/ρ测量方法 读数 计算ρ=m/V Chapter 2 Describing Motion2.1 Understanding Speed 公式：Speed(average)(v)=Total Distance(s)/​Total Time(t) SI units: m/s Speed in the laboratorylight gate法1: start the timer: peg attached to the trolley breaks the beam of one of the light gate stop the timer: breaks the second timer法2： mount an interrupt card(遮光片) on the trolley start the timer: the leading edge of the interrupt card breaks the beam stop the timer: the trailing edge passed the gate 2.2 Distance-time Graphs注意看清楚横轴和纵轴 2.3 Understanding Acceleration 定义：acceleration: 加速度the rate at which its speed is changing/the change in speed per unit time 性质：vector矢量 e.g.velocityscalar标量 e.g.speed. (具体见3.6） 图像：speed-time graph the steeper the slope, the greater the acceleration a negative slope means a deceleration a horizontal graph(slope=0) meeans a constant speeddistance travelled=area under speed-time graph 2.4 Calculating Speed And Acceleration 公式：Acceleration (m/s)2=y2​−y1​​/x2​−x1​= Δv​/Δt 本章注意点 公式 实验（light gates） 图像的绘制，性质，相关计算 矢量和标量的区别（具体见3.6） Chapter 3 Forces And Motions3.1 We Have Lift-Off 牛顿（Newton)1N=举起一个苹果的力定义：the force required to give a mass of 1 kg an acceleration of 1 m/s^2 各种种类的力： 重力(gravity)—the weight 支持力(constant force)—-when two objects touch 摩擦力(friction)—opposes motion 空气/液体阻力(air resistance/drag) 浮力(upthrust) 力的性质&amp;合力：1）力有方向，大小，作用点2）力可以改变物体的速度和方向3）合力(resultant force):合力定义：the single force that has the same effect on a body as two or more forces合力性质：当合力为0时，物体没有加速度，并且物体保持静止或匀速直线运动合力判定：当物体物体没有加速度，并且物体保持静止或匀速直线运动，合力为0合力计算：注意合力有方向！triangle rule&amp;parallelogram rule(见3.6）注意位移 3.2 Mass, Weight and Gravity 重力(gravity)：定义：the force that exists between any two objects with mass方向：vertical downward the acceleration of free fall/acceleration due to gravity/gravitational field strength on Earth(g):g=9.8N/kg关于the acceleration of free fall和acceleration due to gravity和gravitational field strength的区别：the acceleration of free fall和acceleration due to gravity是一个东西，都是指地球上的ggravitational field strength指g，如果在后面加一个“on Earth”就是上面那两个东西的意思了 g的计算：gravitational field strength(g)=weight(W)/mass(m) weight和mass的区别:点击图片尽享高清以上图片取自物理八年级下教材解析 3.3 Falling And Turning terminal velocity: 终端速度 一个例子：跳伞运动员(parachutist)当他往下坠落的时候，一开始他的重力比空气阻力大，后来他的重力和阻力一样大，当他把伞打开时重力比阻力小，最后他的重力和阻力再次一样大。（速度时间图是一个长得像海啸的东西，参照IG书第50页） 圆周运动：【易错点】圆周运动中的加速度方向是从圆上一点指向圆心的一个箭头，一瞬间的运动方向是从圆上一点沿切线出去的一个箭头。（口诀：半径加速度，切线一瞬间）如何增加圆周中的合力：1）增加物体质量 2）增加物体速度 3）减小圆周半径 3.4 Force, Mass and Acceleration 公式：force=mass*accelerationF=ma 注意点：质量必须是kg单位，不是g，如果力是以N为单位。 3.5 Momentum 定义：momentum 动量：动量(是指国际单位制中的单位为kg·m/s ，量纲MLT⁻¹）表示为物体的质量和速度的乘积，是与物体的质量和速度相关的物理量，指的是运动物体的作用效果。动量也是矢量，它的方向与速度的方向相同。（摘自百度百科，有下划线字点开会跳转到对应的百度百科页面） 公式：1！！momentum=the quantity mass* velocityp=m*v（同样的公式可以被用来求m和v）2！！ impulse 冲量：impulse=the change in momentumimpulse=FΔt=Δ(mv)3！！ resultant force:resultant force=change in momentum/unit timeF=Δp/Δt=Δ(mv)/Δt the principle of the conservation of momentum:动量守恒定律the total momentum is constant and does not change because of an interaction between bodies(such as collisions撞击)total momentum before=total momentum after 3.6 More About Schalars and Vectors Schalars: 标量has magnitude onlyschalar quantities: distance, time, speed, mass, energy, temperature Vectors: 矢量has magnitude and directionvectors quantities: velocity, force, weight, acceleration, momentum, electric field strength, gravitational field strength 关于triangle rule：书上写的实际是vector triangle法。首先把两条力等比画出来（一定要等比，画完还要在下面标注一下比例尺度），用箭头表示清楚力的方向。然后把第一个力的箭尾和第二个力的箭头连起来，这条线就是合力了，一个三角形也出现了。把三角形成功画出来后，可以用直接测量法，也可以用勾股定理(Pythagoras’ Theorem)。 本章注意点 合力的计算 矢量和标量 force, momentum等的公式","categories":[{"name":"IGCSE","slug":"IGCSE","permalink":"https://olivezq.github.io/categories/IGCSE/"}],"tags":[{"name":"Physics","slug":"Physics","permalink":"https://olivezq.github.io/tags/Physics/"}]},{"title":"My NEC DR Experience","slug":"My-NEC-DR-Experience","date":"2021-12-25T03:28:03.000Z","updated":"2021-12-25T03:41:31.296Z","comments":true,"path":"2021/12/25/My-NEC-DR-Experience/","link":"","permalink":"https://olivezq.github.io/2021/12/25/My-NEC-DR-Experience/","excerpt":"","text":"My NEC DR Experience Winter VocationThe story began before I go to high school.By accident, I met one of my new classmates who became our team leader in the end, and soon agreed to join his NEC team. At that time, I thought this was only one of the common things that I have to experience during high school, but I was wrong. It clearly brought me unique practical knowledge and feelings that no other incident can. LessonsNEC, short for National Economics Competition, is divided into three levels to choose from. The easiest level, suitable for PAL students like us, is called PRE. For students in AS and A2, they are asked to take higher levels, DR and AS, while AS the most difficult.Sonic, our leader, told us that his teacher advised him to compete DR. I was surprised at first because we had never studied Economics before, but I still accepted that option without giving it much thought.We soon regret. Everyone else in PAL signed for PRE and people who would compete with us were all from higher grades. But with much courage, we decided to try our best.Well, he who knows not fears not.To catch up our Economics, we attended several NEC courses outside school. We also joined our school’s Economics Club to receive further education.I always remember those nights. When everyone got their schoolbags and left the classroom, the three of us would travel far away to a plaza to study Economics, Sonic, Kevin and me. Crowded in a small room, where we learn about absolute advantages, tariffs, quotas, inflation and things like that. We learned both micro and macro at the same time, sometimes even international and current events, because we didn’t have time left.Those nights, after the lesson, I would leaned against the bus’s window, watching the streetlights passing. Thinking about the future which seemed to be so unclear. The Preliminary TestWe found the fourth teammate online. After all the preparation, the test was imminent, and we were more nervous than ever before.I double checked my computer’s camera which was working well and spent the whole Saturday and Sunday preparinng. Before the competition, my teammates sent several encouraging messages both to me and in the group which was touching.The test ended like it was no more than a normal test. Then we had another week waiting for our results anxiously. Results“Is the results coming out today?” I asked.Getting an affirmative answer, I took a deep breath.In the afternoon, when I was working on my GitHub, Sonic texted me in an urgent tone. Then I clicked on the “Bloom” icon, and saw the Chinese characters of “rise in rank”, red and big.It took me a while to realize what had just happended. I then thousands checked the results, clicking the “see results” icon again and again. My teammates exclaimed their joy in almost every social media, and the next few hours my computer was busy in replying congradulation messages.It was so unbelievable. So, so, so, unbelievable.We competed with people older than us, and we managed to win out more than a half of them. All beacause of our supportive parents, our respected teachers, and every hardworking member in our team.Our next stop would be Changsha, Hunan in March.And I think, the future is bright.Boom like a TNT.As Sonic claimed in our group’s description.","categories":[{"name":"Life","slug":"Life","permalink":"https://olivezq.github.io/categories/Life/"}],"tags":[{"name":"Experience","slug":"Experience","permalink":"https://olivezq.github.io/tags/Experience/"},{"name":"Economics","slug":"Economics","permalink":"https://olivezq.github.io/tags/Economics/"},{"name":"NEC","slug":"NEC","permalink":"https://olivezq.github.io/tags/NEC/"}]},{"title":"good morning your honor","slug":"demo","date":"2021-12-24T02:47:40.000Z","updated":"2021-12-30T13:02:12.796Z","comments":true,"path":"2021/12/24/demo/","link":"","permalink":"https://olivezq.github.io/2021/12/24/demo/","excerpt":"","text":"Yet this is a test.GOOD MORNING YOUR HONOR!","categories":[],"tags":[{"name":"demo","slug":"demo","permalink":"https://olivezq.github.io/tags/demo/"},{"name":"测试","slug":"测试","permalink":"https://olivezq.github.io/tags/%E6%B5%8B%E8%AF%95/"}]}],"categories":[{"name":"Life","slug":"Life","permalink":"https://olivezq.github.io/categories/Life/"},{"name":"IGCSE","slug":"IGCSE","permalink":"https://olivezq.github.io/categories/IGCSE/"}],"tags":[{"name":"2021","slug":"2021","permalink":"https://olivezq.github.io/tags/2021/"},{"name":"Experience","slug":"Experience","permalink":"https://olivezq.github.io/tags/Experience/"},{"name":"Summary","slug":"Summary","permalink":"https://olivezq.github.io/tags/Summary/"},{"name":"Physics","slug":"Physics","permalink":"https://olivezq.github.io/tags/Physics/"},{"name":"Economics","slug":"Economics","permalink":"https://olivezq.github.io/tags/Economics/"},{"name":"NEC","slug":"NEC","permalink":"https://olivezq.github.io/tags/NEC/"},{"name":"demo","slug":"demo","permalink":"https://olivezq.github.io/tags/demo/"},{"name":"测试","slug":"测试","permalink":"https://olivezq.github.io/tags/%E6%B5%8B%E8%AF%95/"}]}