{"meta":{"title":"doradolive","subtitle":"","description":"运筹帷幄之中，决胜于千里之外。","author":"Olivezq","url":"https://Olivezq.github.io","root":"/"},"pages":[{"title":"About","date":"2021-12-24T03:58:14.000Z","updated":"2022-01-22T06:05:52.958Z","comments":true,"path":"about/index.html","permalink":"https://olivezq.github.io/about/index.html","excerpt":"","text":"About the author: Hello world! Actually there’s no much thing to talk about. But anyway. My name is Olive and this is my first personal site. I was born in 2006, an urban child. In 2021, I graduated from The Second Yu Ying Foreign Languages School of Nanjing and started my life in Jinling High School International Department A-Level Centre. Well that’s quite both two long names. I am a 70% INTJ and 30% ENTJ, according to MBTI. I am also a slytherclaw(both Slytherin and Ravenclaw). The reason I call this site “doradolive” is that it contains two names: dorado and olive. Dorado is a Spanish word meaning “golden”, also acts as a name for a marine fish with silver and bright blue coloration when alive. I also considered calling this site “ocellradolive” but that seemed too long for a name. I take interest in Mathematics, Chinese, Economics, Computer Science and Linguistics. I’ll update this page if I want to change anything but for now, that’s all. Welcome. About the site: This site includes three parts and these parts are named under the name of “categories”. The first category is “Life”. It’s about my personal experiences, like some competitions I take part in, school life and a little bit of fiction writing. The second category is “IGCSE”. In this part, I updated several IGCSE subjects’s theory in a Chinese version, to make every Chinese students who study IGCSE have a better understanding of these subjects. I may also update videos, depending on my leisure time. The third category is “Rationality”. I come up with thoughts about rationality and some philosophical point from time to time, so recording these thoughts needs to become a habbit so I can see whether I have improved. Some researches and investigations I did will also be updated here. All the posts are owned by me. Including the “IGCSE” category, because I made all the summaries and notes and videos and updates by myself. The whole site belongs to GitHub and Hexo and me, because GitHub and Hexo provide a site to be built, and I build this site all by myself. Welcome."},{"title":"tags","date":"2021-12-24T05:17:47.000Z","updated":"2021-12-24T05:28:56.776Z","comments":true,"path":"tags/index.html","permalink":"https://olivezq.github.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2021-12-24T05:11:45.000Z","updated":"2021-12-24T05:14:08.309Z","comments":true,"path":"categories/index.html","permalink":"https://olivezq.github.io/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"IGCSE Extended Math Theory（中文版）","slug":"IG-ExM-Theory","date":"2022-01-28T11:53:52.000Z","updated":"2022-01-28T11:56:15.562Z","comments":true,"path":"2022/01/28/IG-ExM-Theory/","link":"","permalink":"https://olivezq.github.io/2022/01/28/IG-ExM-Theory/","excerpt":"","text":"IGCSE Extended Math Theory（中文版）click to overview:Ex-M-theory-pdfclick to download immediately:download A/N: This is a note(or you may call: theory) I made for myself when I was doing a quick review of IGCSE Extended Math.Yet I thought: Why don’t I put this on my Github?And that’s how it happened.Due to equations which are almost everywhere in my note, which, is a big problem because my hexo doesn’t provide maths symbols, I could only choose to upload this in a “link” way. If this link confused you, my fault(sorry).I aim to help Chinese students to have a better understanding of IGCSE courses, so do not use for commercial purposes. Commercial use is not allowed.And please, whenever you forward or transmit this note, make sure you adressed the original author properly. Thank you.","categories":[{"name":"IGCSE","slug":"IGCSE","permalink":"https://olivezq.github.io/categories/IGCSE/"}],"tags":[{"name":"Extended Math","slug":"Extended-Math","permalink":"https://olivezq.github.io/tags/Extended-Math/"}]},{"title":"How I Am Productive","slug":"Productive","date":"2022-01-25T07:44:24.000Z","updated":"2022-01-25T13:42:49.126Z","comments":true,"path":"2022/01/25/Productive/","link":"","permalink":"https://olivezq.github.io/2022/01/25/Productive/","excerpt":"","text":"我是怎么高产的关于How I Am Productive的中文翻译。原作者：Peter Wildeford原文网址：https://www.lesswrong.com/posts/JTHe5oGvdj6T73o4o/how-i-am-productive 我喜欢“我把很多事情搞定”这个想法。意识到这一点的其他人会问我为什么这么高产。这篇文章是我试图“分享我的秘诀”的地方，可以这么说。 真正的秘密是，在以前，我离高产差的很远。与拖延作斗争，有问题按时完成作业，而且总是觉得我从来没有足够的时间做事。但是，从一月份开始并一直坚持到目前为止八个月，我在生活中慢慢地实施了几个系统和习惯，这些系统和习惯加在一起，让我变得富有成效。高产不是我的天赋–我是在过去几个月里学会了怎么高产，而且我的习惯让我基本不能不高产。 希望这些系统可以对你有帮助。我见过一些人采纳同样的系统并取得成功，但我从未见过任何人完全像我一样这样做。也许完全按照我的方式做这件事甚至会很糟糕，因为每个人都有点不同。我意识到了其他优化，并让你知道到底什么对我有用。我没有声称这些系统就会对你有用。你的里程可能会有所不同。 所以这些系统是什么呢？为了让你高产，我们需要让你组织安排，考虑优先，然后实行完成和复盘回顾。拥有这四样东西，你就会拥有提高生产力所需的一切。 组织安排高产的第一步是组织起来，不靠专门记忆地记住事物。即使我们关闭这些系统，你也不会忘记你的想法，事件何时何地，你需要完成哪些任务，你有哪些文件，你有哪些电子邮件。 最重要的规则：把事情写下来如果你只从一个类别中拿走一个系统，我希望它是这个。关于这些系统可以写出好几篇文章，而这个也不例外——把事情写下来。每当你有很酷的想法、活动邀请、任务等时，请写下来。总是。不断。没有借口。 我在生活中发现，压力出人意料地来自试图将所有东西都留在我的脑海中。当我写下我认为值得记住的一切时，无论是我需要做的具体事情，还是只是一个酷但无关紧要的想法，我想稍后跟进，我都会把它写下来。这让它从我的脑中被清理出去，我就不再觉得有必要记住一些事情（只要我以后记得查一下），我感觉好多了。 我还在我的生活中发现，我会不断地认为我肯定会记住一些事情，所以它们不值得写下来。一半多的时间里，我错了，忘记了这些事。这意味着我忘记了很酷的想法，甚至忘记了事件或完成关键项目。永远把事情写下来，无论你多么确信你会记住它们。 你怎么做到这一点？我建议你准备一些永远都随身携带的东西，你可以把事情写下来的。对于我的绝大多数读者来说，这可能是一部可以给自己发短信的手机。很长一段时间，我会用智能手机给自己发电子邮件，因为我知道我以后总是会检查我的电子邮件，然后可以将想法记录到文本文档中。后来，我开始在Evernote上记录想法，然后开始用Workflowy记录想法。 Workflowy每月要花费5美元才能充分运用它（在我看来，这是值得的），但也有免费的替代品（在我看来，这些替代品就并没有那么好）。 然而，如果同样可以完成工作，不要回避那支好的旧钢笔和纸。我以6美元买了这个记事本，还是很不错的。 记录事件：日历当然，你想写的一些事情将有可能是需要记录在特别有用的地方的特定事情。其中一种特定事情是事件，或者是你需要在特定时间和地点的时候。为此，你可以使用任何日历，但我最喜欢的是谷歌日历。每当你被邀请参加活动时，请将其记录在日历上。（我们稍后会讲怎么定期查看你的日历，这样你就不会忘记那里有什么。） 我看到人们犯的一个常见错误是依靠Facebook事件来跟踪他们的事件。也许这对一些人有效，但并非所有活动都是通过Facebook完成的，也可以通过Facebook完成，因此你最终会跟踪多个地方的事件，这会导致混乱和错过事件。无论你在哪里记录事件，只在一个地方记录所有事件。 记录任务：To-Do List接下来你会想要记录的就是任务。为此，你需要一个To-Do List(待办事项清单）。我一生中的大部分时间都在使用TextEdit文档，但我建议你改用专用应用程序。我个人也在这里使用Workflowy，但其他的程序也工作得很好。过去，我用Trello取得了巨大成功。我见过其他人在Asana上取得成功，有些人甚至只是用电脑上的文本文档。 我看到人们在这里犯的一个常见错误是使用电子邮件作为To-Do List。这可能看上去有些道理，但电子邮件通常包含任务不需要的信息，这会减慢您的速度，而且有时电子邮件包含多个操作要点。更糟糕的是，电子邮件中不能简单地将任务分出优先级（这真的很重要，一会儿会讲到）。 底线：将你的所有任务放在一个简洁、干净的地方。不要将你的To-Do List分散到多个应用程序中，也不要将其与许多其他内容混在一起放。 行动、等待、参考：使用“区域”保持井然有序一旦你把想法写下来，日历上的事件，To-Do List上的任务，是时候整理你必须处理的材料了。一整天过去了，许多物理文件和计算机文档都会出现在你身边，是时候整理它们了。这里的诀窍？弄出一个可以保持清晰的表面积，并将其划分为三个区域：行动区、等待区和参考区。 行动区是用于需要去完成的事情。你有你需要填写的表格吗？你需要读的东西？甚至一些奇怪的事情，比如你需要修理的项链什么的？将任务所需的一切放在文件夹中，或根据需要使用回形针，将其放入行动区，并将任务记录在To-Do List里。 等待区是用于一些最终需要去完成的事情，但这些事情还无法完成，因为你在等待一些事情。也许你需要某人的反馈，一个包裹仍然需要到达，或者任务只能在某一天完成。为此，将所有内容分组到等待区，并在To-Do List中记录任务和等待的内容。（稍后我们再重新查看To-Do List中的实施部分。）将事情付诸行动，并在你等待的东西到达时更新To-Do List。 参考区适用于你可能需要查看和保存的东西，但并不与任何任务有关。例如，我在参考区拥有的东西是密码、来自人们的任务的详细信息、与我正在做的工作相关但没有必要的项目等。 始终收件箱零：将文件夹应用于您的电子邮件对大多数人来说，电子邮件真的很乱，但其实不必如此。这里的解决方案也是将区域应用到电子邮件中。我使用Gmail，但最近几乎每个电子邮件系统都包含文件夹。使用该系统在电子邮件中创建三个文件夹——行动、等待和参考——然后根据文件夹对电子邮件进行排序，并在待办事项列表中记录。 你的收件箱中没有理由有任何电子邮件。你应该一直处于“收件箱零”。每当电子邮件进来时，都要处理并存档。收到Nancy的电子邮件，你需要回复吗？把它放在“行动”中，然后把“回复Nancy的电子邮件”放在To-Do List中。收到你老板的一封很长的电子邮件，你甚至还没时间阅读？把它放在“行动”中，然后把“阅读老板的电子邮件”放在To-Do List中。然后，当你回去阅读它时，你可以确定下一个To-Do。 把电子邮件放在“等待”也是有道理的。如果从某个电子邮件中收到回复很重要，我会把它放在”等待“来提醒自己必要时稍后跟进（稍后会详细介绍）。如果我想先收到别人的回复，或者如果是我还无法采取行动的行动项目的信息，或者我想稍后回复，我也会把电子邮件放在“等待”中。 最后，对于你需要随时阅读但无需回复的电子邮件来说，“参考”非常重要。人们发送给我的许多笔记被处理到我的相关Workflowy文档中，然后只要它们有用，就会作为“参考”。 考虑优先既然你现在已经组织好了，是时候做好你需要做的事情了。但要小心，因为除非你有时间一次性完成整个To-Do List，否则从上到下开始做事会拙劣地浪费时间。相反，我们需要从最重要的到最不重要的。 艾森豪威尔矩阵：做重要的事情你如何确定优先级？我看过的最好的战术叫做艾森豪威尔矩阵。它来自史蒂文·科维的书《First Thing First》，但归功于美国总统德怀特·戴维·艾森豪威尔。 这是说，你将To-Do List整理成四个象限：重要和紧急、重要和不紧急、不重要和紧急、不重要和不紧急。这在Workflowy上做非常容易，在Trello之类的东西上也是可以做的。 人们普遍认为，你首先完成所有“重要和紧急”的任务，最后完成“不重要和不紧急”的任务。但真正的诀窍是，在完成重要而紧急的任务后，你应该采取行动完成重要而不紧急的任务。在完成所有重要任务之前，忽略不重要和紧急的任务，甚至在必要时可以放心跳过不重要的任务。为什么？因为它们不重要。 如果你运用好了这个矩阵，你很快就会在完成任务上取得进步，因为在重要任务变得紧迫之前，你将完成它们。 此外，请注意，这里包含“等待”作为我To-Do List中的选项卡之一。这就是我把我还无法完成的任务放在上面，并记录我在等待什么。三天后和我爸爸说话之类的事情会被标记为“#30aug :: Talk to Dad”（使用Workflowy标签），但我也会做日期不明确的事情，比如“Brian回复电子邮件：转发对Seth的回复”。请注意，能不能够管理不明确的截止日期（你不知道任务将在哪一天）是大多数待办事项列表应用程序难以解决的问题。 时间框：提前计划你的一天接下来要掌握的“考虑优先”是提前计划你的一天。你通过为事物制作“时间框”或进行预定义内容的时间段来做到这一点。例如，我会留出一些时间来处理我的To-Do List或处理特定项目。对于更大的项目，我会决定我在任何特定的日子或一周内想做多少工作，并将它们放在我的To-Do List中。然后我会在日历上为他们画出时间段，最后是这样的日子。 由于我使用这种时间框方法提前计划我的日子，我只需提前计划日历的每一分钟，并制定一个计划，这样我就可以随时知道该做什么，永远不会错过任何节拍。当然，突发事情会产生，导致你必须改变一天的计划，但这总比完全没有计划要好。 两分钟法则然而，重要的是要注意记录任务需要多长时间，将其放入To-Do List并对其进行优先排序。对于大多数人来说，包括我，任何给定的任务大约需要超过两分钟。这引发了“两分钟法则”：如果做某事只需要不到两分钟，现在就去做吧。同样，如果需要两分钟以上，请将其放在To-Do List中，并在最佳时间进行。 实行完成现在你已经设置了To-Do List和时间框，用于何时工作以及做什么，是时候实际完成工作了。 番茄工作法理想的时间框应该是30分钟的倍长，这样你就可以做最强大生产力的事情：用番茄工作法。当心这对某些人来说行不通，但我确实敦促你给它一次机会，尝试几次，因为对于那些适合番茄工作法的人来说，它会带来奇迹。 这是你怎么做的。将计时器设置为25分钟。在这25分钟内（a）只处理手头的任务；（b）不要做任何其他事情，哪怕是一秒钟；（c）完全集中注意力；（d）没有可以分心的东西；（e）不要多任务处理。然而，在番茄工作期间，有一些可以接受的事情可以做：去洗手间，喝水，听音乐。但在番茄工作期间更多的还是不能做的事情：查看Facebook、阅读电子邮件等。我可以一直往下举例。 时间到了后，休息五分钟。在这五分钟内，除了手头的任务外，你想做什么就做什么。即使你觉得休息很无聊，而且你渴望重新开始工作，也不要。从长远来看，你只是在伤害自己。这五分钟的休息时间将恢复你的注意力，让你脚踏实地，提供一种在不同的环境中思考你的想法的方法，并防止你在一天中的晚些时候需要更长的休息时间。 然而，应该指出的是，番茄工作可能有点难养成习惯。于此，为了解决这个问题，我发现花一个月的时间习惯“15分钟的工作，5分钟的休息”，然后再花一个月的时间习惯“20分钟的工作，5分钟的休息”，最后“25分钟的工作，5分钟的休息”来达到完整的番茄工作是有帮助的。 除了25和5外，不同的人尝试过其他倍数，但我仍然相信25-5是理想的组合。也许27-3可以更好地适用于高级番茄工作用户，但我不会进一步推动它。我见过90-30或30-10之类的东西，所有这些似乎都涉及工作时间太长（失去焦点），然后休息时间比必要的多得多。当然，如果它适合你，那么它就起作用了。 这是我使用的25-5秒表和20-5秒表。我也喜欢Tomato Timer.com，但任何计时器都可以用。 对休息感到舒适大量工作的重要教训是一定要对休息一下感到舒适。想要高产的新手会认为不通过休息继续工作是良性的，甚至认为他或她正在更好地利用他们的时间，击败着所有需要休息的弱鸡！但说实话，这个人只是在设置自己的垮台，因为他们会崩溃和自焚。 崩溃是真实发生的，你能做的最危险的事情之一就是训练自己为不工作感到内疚。所以你需要记得休息一下。番茄工作的休息时间很好，但我也建议在完成三到四番茄工作后休息得更长（比如30分钟）。 我想大力支持的一个特别好的休息方法是打个盹。有规律地打盹对健康有好处（另见这里、这里和这里），如果你午睡20分钟，下午或晚上不打盹打得太多，也不会损害你的夜间睡眠。事实上，我发现午睡可以节省时间，而不是“浪费”休息时间，因为我晚上可以少睡，但仍然感到休息并全天专注。 保持你的活力防止你崩溃和需要长时间休息来恢复能量的另一件事是保持精力充沛。我建议喝一些有点糖但没有那么多糖的东西（我喝25%-75%的混合水稀释柠檬水），并记得定期锻炼。此外，健康饮食和正确睡眠有助于让你专注于工作。 复盘回顾当然，如果你不打算从你的表现和进步中学习，以上是不够的。我建议你在多个层面上回顾你的生活——每天、每周、每月和每六个月回顾一次。 对于每日复盘，我跟踪我是否在锻炼和正确饮食等某些习惯上取得了成功，并记录我在各种事情上花费的时间，以便跟踪我的时间使用情况。我还完成了其他相关的日志，然后花点时间反思当天的情况，并思考重复成功和避免错误的方法。然后，我查看第二天的计划，并在必要时进行调整。这个过程花我大约15到20分钟。 对于每周复盘，我都会检查我的行动-等待-参考区，无论它们在哪里存在（物理性堆积、电子邮件和计算机文件夹），并处理它们——确保那里的所有内容仍然相关，并且仍然属于对的地方。在这个阶段，我会删除任何需要删除的内容，并提醒自己我在工作什么。我会整理和清理现阶段没有组织的东西，并将所有东西都整理好。然后，我将快速重读我的战略计划，并根据我的目标规划下周。最近，我设置了每周想花在某些项目上的时间，所以现在这是一个制定一个有效的时间表的问题。这个过程通常需要我45分钟到一个小时。 对于每月复盘，我反思我本月一直在尝试养成的习惯，并决定我想保留哪些习惯，我想添加哪些习惯，以及我想减去哪些习惯。我回顾了整个月份是如何进行的，并思考我能做些什么来重复成功和避免未来的失败。然后我写下一篇反思，并把它发布在我的博客上。这个过程通常需要我两个小时。 对于每六月的复盘，我回到我的目标，并思考我整个人生轨迹和去向。我的生活目标是什么？我正在做什么来完成它们？我比六个月前更接近我的目标吗？我应该开始努力实现新目标了吗？在过去的六个月里，有哪些常见错误是我想避免的？然后，我写一份文件，说明我未来六个月的个人使命和目标，并每周浏览一次，以不断提醒自己我想做什么。这个过程通常需要我三个小时。 是的，总有一天你会要做所有四个复盘，花大约六个半小时在不同层次上回顾你的生活。也许这对人们来说有点多，但我从中发现了巨大的好处。我发现，花这一天回顾我的生活将我从几天甚至几个月的浪费时间中拯救了我，而这些浪费的时间没有实现我真正想做的事情。复盘回顾是节省时间的另一种方式。 附加建议现在我已经给了你我所有的主要建议，但如果你想继续阅读，我有一些额外的提示。 随着时间的推移，小心地养成这些习惯。这是一次要做的很多事情，所以分阶段做吧。养成先写下东西的习惯，然后慢慢地将你喜欢的应用程序用于列出想法、事件和任务。完成此操作后，请花必要的时间整理电子邮件，并尽可能实现这些区域。然后开始使用艾森豪威尔矩阵确定任务的优先级。完成这一点后，开始使用时间框提前计划您的一天，并开始进行复盘。当你正在养成这些习惯时，同时开始养成番茄工作习惯，几个月后慢慢接近25-5。 找到一种可靠地保持习惯的方法。不要发生坚持某事一两个月并放弃它这种常见的失败。花很多精力思考你将如何保持习惯，以及你将如何不像所有其他认为自己会保持习惯然后失败的人。与朋友打赌，启动Beeminder，或创建其他类型的任务提醒设备。 形成生产力心态。在我能够将自己视为一个做重要事情的重要人物，并且应该亲自珍惜我的时间之前，我在实施该计划之前遇到了很多困难。在开始提高生产力之前，我必须真正想提高工作效率。这方面的成功将来自正确的心态。是时候开始认为自己很重要了。如果你不能愚弄自己，也许是时候看看你的目标，决定什么目标会让你感到自己很重要，然后转而做这些目标了。 注意常规的力量。我发现，如果我有“每隔一天，醒来后”或“每隔一天，就在晚餐前”的例行公事，锻炼要容易得多。你的例程可以从这里构建。如果同一时间框总是出现在同一时间段，那么坚持使用时间框就会变得容易得多。使用日历，给自己框点好东西。 把所有东西都放在一个特定的地方。人们因为四处寻找东西而浪费了很多时间。通过提前花点时间整理生活中的事情，把它们放到特定的地方来解决这个问题。之后一定要确保事物回到他们的位置。 简化你的生活。你需要跟踪的东西越少，需要担心的东西越少，你的工作会更好。扔掉一切，尽可能地委托任何你可以不自己做的事。 找一个有生产力的地方。这在大学里特别有效，那里有各种各样的工作地点。找一个工作场所，设置你的番茄工作闹钟，然后跟着闹钟工作。不要搞砸。在别的地方来进行你更久的休息。如果你确实搞砸了，请找一个新的生产力地方，然后重新开始。我发现这对我的心态真的很有帮助，但其他人觉得这很傻。 不要忽视朋友和家人。这是个大事。请记住，提高工作效率的目标是腾出时间做你想做的事情，并与你想要和他们在一起的人在一起。而不是每周花100个小时的时间忽视那些对你很重要的人。确保有时请个与朋友和家人共度时光。如果有必要，请在日历中安排它。从长远来看，这对你的生命至关重要。 生产力 ≠ 繁忙并且繁忙 ≠ 生产力。如果你是在很好地高产，你不应该经常感到忙碌。忙碌是生产力低下和/或承担了太多事情的标志，也很少是正确行事的标志。 总结这些建议真的是我实验了八个月的结果。我希望你花同样多的时间从零到高产，并最终使用适合你和你的环境的不同系统。但我认为我的系统很强大，而且我很期待看到别人的系统，其他人是如何与它们一起运行的。毕竟，他们是对我有用。","categories":[{"name":"Rationality","slug":"Rationality","permalink":"https://olivezq.github.io/categories/Rationality/"}],"tags":[{"name":"Practical","slug":"Practical","permalink":"https://olivezq.github.io/tags/Practical/"},{"name":"Translation","slug":"Translation","permalink":"https://olivezq.github.io/tags/Translation/"},{"name":"Productivity","slug":"Productivity","permalink":"https://olivezq.github.io/tags/Productivity/"}]},{"title":"100 Tips for a Better Life","slug":"100-Tips-for-a-Better-Life","date":"2022-01-22T05:52:18.000Z","updated":"2022-01-25T07:55:56.672Z","comments":true,"path":"2022/01/22/100-Tips-for-a-Better-Life/","link":"","permalink":"https://olivezq.github.io/2022/01/22/100-Tips-for-a-Better-Life/","excerpt":"","text":"100个生活建议关于100 Tips for a Better Life的中文翻译。原文作者：Ideopunk原文网址：https://www.lesswrong.com/posts/7hFeMWC6Y5eaSixbD/100-tips-for-a-better-life 财产1.如果你想要知道人们对一个产品的意见，用谷歌搜索&lt;产品名&gt;reddit。你会得到真正的意见，而不是搜索引擎想让你看到的。2.注册账号时，一些银行收你20刀，一些银行不收钱。如果你的银行属于前者，问清楚那20刀是干什么用的。3.你人生中大部分时间都要用的东西（床：1/3，公司座椅：1/4）是值得花钱的。4.“那个好用的刀在哪？”如果你在找你的好的X，说明你有坏的X。把它们扔出去。5.如果你的工作是需要在电脑上完成的，买两个设备。更少的时间在窗口间横跳意味着更多的时间可以用来思考。6.关于什么时候扔垃圾要有明确的规定。一旦规定确定了，垃圾就不会是一个问题了。这是因为明确的规定相比我们含糊的计划要更占优势（“留着这个立体声回响最多5年，以防有天我知道该怎么修它了”）。7.不要给别人买CD。他们有音乐软件。给他们买他们喜欢的乐队的周边。这样更加私人化而且乐队能赚更多的钱。8.在买东西时，时间和金钱相互权衡。如果你钱少，花更多的时间找到最好的交易。如果你时间少，停止四处找最好的交易并在线快速买东西。 烹饪9.煮的分钟：绿茶3，红茶4，凉茶5。好茶就是这么简单！10.食物其实可以既便宜，健康，好吃又可以相对快速地做好。这只需要在某一天中花几个小时准备一整周的许多菜。11.烹饪会污染空气。烹饪后把窗子打开几分钟可以极好地提高空气质量。12.通过简单的调味料，食物的味道可以变得令人更加兴奋。这也是一个可以表达情感的机会。买一些草药和香料并去实验吧。13.在搜索食谱时，在前面加上“最好的”。你会发现更好的食谱。 效率14.带上高级的搜索特征是创建更紧密搜索语句的快速方法。比如输入“img html”会比“img html -w3”输出更差的结果。15.你可以用Autohotkey（或者AppleScript）使电脑自动化执行普通任务。如果你不停在做一系列“简单到一个电脑都会做的事”，让电脑做。16.学键盘快捷键。它们很容易上手而且你做任务时会更快更容易。17.完成比完美好。18.保持桌面和工作环境整洁。把每个物品当作一个你不值得注意的东西，因为它就是。一个工作的地方不是一个你存储堆积的地方。它是一个完成事情的地方。19.完成挑战后给自己奖励，即使完成得很糟糕。 身体 20-20-20守则：每看屏幕20分钟，花20秒看一个离你20英尺远的地方。这会减少眼睛疲劳而且易于记忆。 锻炼（举重）不仅会创造肌肉质量，也会优化骨架结构。举！ 锻炼是你可以做的最重要的生活方式介入。即使是很少的（15分钟一周）也会有很大的影响。从小做起。 （这不是一个医学建议）不要在复合维生素上浪费钱，它们没有用。维生素D倒确实有点用并且重要，因为人们经常缺维生素D。 在过去十年里手机变重了而且它在你手上时其实还蛮坚硬的！有条件的话还是用一个电脑，或者至少试着把手机支起来。 成功25.历史记得那些第一个得到市场的人。将你的创造推向世界比让它完美更加重要。26.你是不是在分手或者换工作的边缘？你应该就去这么做。人们，平均来说，如果他们冒险，最后他们会更快乐点。27.纪律胜于动机。前者可以被训练，后者是短暂的。你不会有能力去做伟大的事如果你只依赖动机。28.你可以通过练习提高你的交际能力，这比你通过练习提高你的智力要更加高效。即使你没有那么聪明但是可以清晰地表达观点，与那些不能表达清晰的人相比，你也有很大的优势。29.你不是生活在电子游戏里。你做蠢事或对着错误的方向走太远时不会有警告弹出来。你必须创造自己的警告。30.如果你在听成功人士讲述他们的方法，记住那些用同样方法却失败的人并不会也做关于他们失败的视频。31.最好的建议是私人化的，而且来源于一个熟知你的人。如果需要，接受广泛的建议，但最好的帮助来源于爱你的诚实朋友。32.让事情完成得越简单越好。找到最简单的方法开始锻炼。找到最简单的方法开始写作。人们让事情比原本更加困难并当失败时变得心烦。试着不要这么做。33.培养可靠性名声。好的名声是有用的因为它们很稀有（容易被摧毁而且很难重建）。你不需要做出最好的咖啡如果你的顾客知道咖啡永远是热的。34.你怎么过的每一天就是你怎么过的你的人生。 理性35.找到别人的偏见很容易，找到自己的偏见很难。然而，它的回报要高得多。36.解释问题是好事。通常在分析问题的过程中，解决方法会自然而然出现。37.愚蠢的人在大多数事情上是对的。努力不让愚蠢的人的意见被自动诋毁。38.你有一个计划。一个来自2030年的穿越者出现了并告诉你你的计划失败了。你觉得你的计划是哪一步出错了？修正那一步。39.如果某件事让你惊讶了一遍又一遍，停止惊讶。40.你应该在看到在百度上你的症状显示你得了绝症时吓得魂飞魄散吗？最好不要！查找疾病的基率并用贝叶斯定理计算。41.自私的人应该听从建议以让自己不自私，不自私的人应该听从建议以让自己自私。这适用于许多事情。不管什么时候得到了一个建议，同样也要思考它的反面。你可能会过滤出你最需要的建议。42.常见的系统和工具是被设计成所有人都可以掌握的样子的。所以不用担心你会不会是唯一一个不能的！你可以学会洗衣服，烹饪，在高速上开车的。 自我43.缺点不会显得你特殊。你年龄越大，在别人眼中你不会做饭的严重性就越大。44.通过更多地了解你的欲望、目标和结构，没有什么人际状况是无法改善的。“认识你自己！”45.如果你小于90岁，尝试一些事情。46.一些不是你的错的事可以仍然是你的责任。47.用你承受的痛苦来定义你自己是一个持续痛苦的高效方法（比如非自愿独身者，精神创伤）。48.保持你的身份渺小。“我不是做那种事情的人”不是一个解释，是一个陷阱。它阻止书呆子出去工作，阻止男人跳舞。49.不要把“因为我喜欢所以我做这件事”和“因为我想被看作是会做这类事的那种人所以我做这件事”混为一谈。50.记住你在死去。51.事件可能会伤害我们，不仅仅是我们对它们的看法。建立韧性是件好事，但有时如果真的有事情让你崩溃了，那不是你的错。52.如果你想要变得有趣，试着只是说些蠢话（在合适的场合）直到找到感觉。53.为了发现你的问题，（大声地）说“我生活中的一切都非常好”。注意你脑中是什么反对意见正在浮现。54.拖延来的很自然，所以把它应用到坏事上。“我现在想要自残。再过一个小时我会自残的。”“我想吸烟了，所以半个小时之后我会去吸烟的。”然后重复。就像我们的好计划可以延迟，我们的坏计划也可以。55.个人顿悟感觉很棒，但它们会在几周内消失。顿悟后，制定计划并开始实际改变行为。56.有时无法解决的问题，比如“我的目的是什么？”和“我为什么要存在？”在生活方式修复上失去力量。换句话说，定期见朋友和充足的睡眠可以大大有助于解决关于存在主义的问题。 隐患57.有两个可以避免几乎所有危险的人的危险信号：1.经常抱怨的人；2.狂暴的人。58.有些人出于习惯将所有事情戏剧化。你可以避开这些人。59.那些让你产生焦虑并向你保证他们有解决方法的人是骗子。看看政治家，商人，法轮功大师等等。避开这些人。60.（这不是一个合法建议）不要和警察讲话。61.让人们谈论自己的价值观、目标、规则和生活方式很容易。当人们的行为与他们的言论相矛盾时，请注意！62.“如果他们会对你这么做，他们就会对你这么做”和“靠剑生活的人死于剑下”是一个道理。你对你自己、朋友或队友说的恶意的借口总有一天会回到你身边，那个时候你就没有借口了。 他人63.在犹豫和0-1个人还是和2个以上的人住在一起时，记住当室友大于1时，责任会被分散而不会被确定（“这些是谁的盘子？”）64.明白人们有权没有品味。65.你甚至会阻止自己有有可能降低你地位的想法。避免因为这样人们就会一直认为你很酷而把自己挡在外。66.在群体里很重要。如果你不想加入运动队，考虑建立一个糟糕的乐团。这是你最接近RPG的游戏。与2-4个其他角色一起训练，学习新动作，从一个酒吧到另一个酒吧，并从NPC那获得任务。67.让人们做一些让你更喜欢他们但更不尊重他们的事情是有可能的。避免这种情况，它会破坏关系。68.想想你为什么喜欢你喜欢的东西。如果你能解释你对《沙丘》的热爱，你现在不仅可以与《沙丘》的粉丝交流，还可以与喜欢有同样方面的其他书籍的人交流。69.当你问人们：“你最喜欢的书/电影/乐队是什么？”而他们结巴了，就问他们目前最喜欢哪本书/电影/乐队。他们几乎总是有一个，并且能够谈论它。70.感到无聊的人很令人无聊。71.与家人一起吃饭时不看东西的规范将导致更好的对话。如果这个想法让你充满恐惧，考虑建立一个新家庭。72.如果你要乘坐公共汽车去其他城市，请考虑拼车。它更便宜、更快，并会导致有趣的对话。 交往73.在人际关系中寻找一个你喜欢而且可以和他仅是在附近闲逛的人。长期关系大多只是令人扫兴。74.有时事情会持续很长时间，因为它们很好（什锦菜）。但这并不意味着，因为某物已经持续了很长时间，所以它是好的（尿道割礼）。酌情将此应用于关系、职业和信仰。75.不要向同事或在线抱怨你的伴侣。好处可以忽略不计，代价是会一点一点摧毁你的灵魂。76.分手后，尽快停止所有联系。产生一个戏剧的潜力是无穷无尽的，而建立良好友谊的潜力微不足道。等一年后再试着再次成为朋友。77.如果你还没有弄清楚性吸引力问题，请记住没有最后期限。如果有人让你感觉有，请考虑他们对你来说不再单单是你的朋友的可能性。78.如果你在约会期间说话有困难，试着说任何你想到的话。在最坏的情况下，你会毁掉一些约会（反正进展总不会顺利的），最好的情况下你会有一些很棒的对话。酒精会有所帮助。79.在约会时，不强调你的怪癖会导致90%的人认为你有点好。强调你的怪癖会导致10%的人认为你迷人而有趣。那些是有兴趣和你约会的人。瞄准他们。80.保持关系需要刺激。新冠疫情期间很难有新奇——但你计划过新冠疫情后的冒险吗？81.人们可能不是坏，只是不适合你。做人既复杂又困难。 共情82.当你想你的父母时，给他们打电话；当你爱你的朋友时，告诉他们。83.更多地赞美别人。除非别人说，否则许多人很难认为自己聪明、漂亮或善良。你可以帮他们。84.如果有人正在接受群体批评，有一部分的你会想加入这正义地摧毁某人的乐趣。抵制这一点，因为这样你只会给世界增添丑陋。无论如何，他们已经吸取了要吸取的教训，而且这可能不是你会想要吸取的教训。85.培养对比你更不聪明的人的同情心。许多人并非是因为自己的过错，而无法处理表格、骗子或复杂情况。善待他们，因为世界并不善待他们。86.为有困难的人培养耐心。沟通极其复杂，涉及传达语气和难懂的想法。许多人几乎这两件事都做不到。不要惩罚他们。87.不要因为那些人尝试而惩罚他们。你要教他们不要尝试你的底线。惩罚包括抱怨他们花了这么长时间，他们做得不好，或者其他人做得更好。88.请记住，许多人遭受无形的痛苦，一些最严重的痛苦是羞耻。不是每个人都能让他们的痛苦变得清晰。89.不要因为人们承认自己错了而惩罚他们，你让他们更难提高。90.一般来说，你会找借口不善待人。抵制这些。 快乐91.人类的情绪和福祉受到简单事物的严重影响：锻炼、良好的睡眠、光明、感受自然。尝试这些很便宜。92.你的政治影响力越来越小，你花在政治上的每一个想法都可能一无所获。考虑搭建东西吧，或者至少去散步。93.史特金定律认为，90%的东西都是垃圾。如果你不喜欢诗歌、美术或其他东西，很可能你只见过垃圾。去看看它们吧！94.你不必热爱你的工作。工作可以是很多事情，但它们也是赚钱的一种方式。许多人通过将赚来的钱花在自己关心的事情上，而在一份好工作中过着美好的生活。95.某些种类的复杂化不会让你更享受它，而是会让你更不享受它。例如，葡萄酒品师并不比你更喜欢葡萄酒，他们只会更敏锐地意识到大多数葡萄酒不够好。避免会减少你的享受的精致。96.如果其他人过得比你更糟糕意味着你不能难过，那么其他人过得比你更好意味着你不能快乐。感受你的感受。97.喜欢和想要是不一样的。有些东西比如垃圾食品，你想要但不喜欢。但你也可以喜欢有些东西（如阅读），而不需要它们。如果你记得喜欢某样东西，但现在对它没有欲望，试着推动自己。98.人们没有意识到他们有多讨厌通勤。离工作地点非常远的好房子不值得你生活中的无聊和疲劳。99.有证据表明，内向者和外向者都能从被推向更外向的过程中受益。下次你不确定是否想出去的时候，请考虑一下。100.坏事会发生得戏剧性（大流行病）。好事会逐渐发生（疟疾死亡人数每年下降），所以感觉不像是“新闻”。努力跟踪好事，以避免对世界的看法不准确和感到沮丧。","categories":[{"name":"Rationality","slug":"Rationality","permalink":"https://olivezq.github.io/categories/Rationality/"}],"tags":[{"name":"Life improvements","slug":"Life-improvements","permalink":"https://olivezq.github.io/tags/Life-improvements/"},{"name":"Practical","slug":"Practical","permalink":"https://olivezq.github.io/tags/Practical/"},{"name":"Translation","slug":"Translation","permalink":"https://olivezq.github.io/tags/Translation/"}]},{"title":"2021 Remix","slug":"2021-Remix","date":"2022-01-09T07:51:07.000Z","updated":"2022-01-10T12:53:55.408Z","comments":true,"path":"2022/01/09/2021-Remix/","link":"","permalink":"https://olivezq.github.io/2022/01/09/2021-Remix/","excerpt":"","text":"2021 Remix “是不是生活太艰难，还是活色生香。我们都遍体鳞伤，也慢慢坏了心肠。”– 朴树《清白之年》 The song above happened to be one of the readings in a Moke Chinese Exam of a district in our city. Either in Gulou or Qinhuai, I don’t quite remember.When Mr. Yang was illustrating this reading, I saw my deskmate wrote the lyric high at the top of the paper.I asked him why, and he shook his head.But that sentence, which generally means “Is life too hard, or live fresh. We were all bruised, and ill-disposed.”in English, was deeply branded in my mind ever since. Because it was so beautiful and real. Sun was just shinning bright as usual and we were having our precious PE lessons. That was when I started to feel sad as I lied down on a pad and looked up at the heavy shades of the tree leaves.I thought about leaving. Leaving this school which I had stayed in for three years, leaving the life I was accustomed to. The last week in my secondary school, I took a digital record pen along with me. Trying to record everything that would eventually leave me.I recorded the wind, the chats, the flood when everyone was rushing towards the school canteen, the tones and intonations of the teachers. Sometimes the rain, the noises of fans, the drop of a pen, the fall down of a pile of books. Even the laughters, the silence. We said goodbye. Almost everyone, Claire, Kevin, Vincent, Apple, Alice, Sun, Laura, Chloe, Cousins, Brian… The leaving still came and I graduated from secondary school. But another story has only just begun. Looking back at last year, I will use “leave” to describe 2021 if I can only use one word. In this year, I graduated, I experienced my best summer holiday ever, I went to an international department, I built up this site, I met new friends. Rewinding and reconsidering, 2021 seemed so unusual.In 2017, I graduated from primary school. It was a dark period of my life and I was very fortunate to come to my secondary school at that time. The journal I kept in 2017 was still in my wardrobe, written my thoughts in ink. Now, I still keep a journal and everytime I review it, I saw times different from those in 2017.But that doesn’t mean 2021 is a totally-happy year. We experienced COVID-19 period and had our final exam which had a decisive influence on our future. We had a lot of pressure, suffered pain. I didn’t go to NFLS as I expected. Time passed fast, like the stream touched across my palm when I washed my hand on the last day of 2021. As the lyric said at the beginning of this remix.Life is hard. You suffered a lot to get used to it. You may get cynical, you may get heart-broken. But as long as you insist on living, accept changes, life is live.","categories":[{"name":"Life","slug":"Life","permalink":"https://olivezq.github.io/categories/Life/"}],"tags":[{"name":"2021","slug":"2021","permalink":"https://olivezq.github.io/tags/2021/"},{"name":"Experience","slug":"Experience","permalink":"https://olivezq.github.io/tags/Experience/"},{"name":"Summary","slug":"Summary","permalink":"https://olivezq.github.io/tags/Summary/"}]},{"title":"IGCSE Physics Theory（中文版)","slug":"IGCSE-Physics-Theory","date":"2021-12-25T06:53:31.000Z","updated":"2021-12-30T13:02:14.248Z","comments":true,"path":"2021/12/25/IGCSE-Physics-Theory/","link":"","permalink":"https://olivezq.github.io/2021/12/25/IGCSE-Physics-Theory/","excerpt":"","text":"一些备用知识点 国际单位：m, kg, s, A, K, mol, cd 牛顿运动定律 Chapter 1 Making Measurements1.1 length&amp;volume 测量工具：1） ruler 尺子 （e.g. metre ruler)测量注意点：（以wire为例）【4步】 straight，laid closely alongside end: cut neatly/ragged line one end of the wire up against the “0” look at the other end and read一定要注意测出来的是否可以保证正确2）游标卡尺 螺旋测微器游标：L=整的毫米数（主尺）+0.1*n毫米（游标） 测量方法1）measure sth. thin以测纸的厚度为例：【3步】 take a stack of 500 sheets measure its thickness devide by 5002）measure sth. curved以测弯曲的铁条为例：【3步】 lay a thread along the line mark the thread at either end lay it along a ruler3）measuring volumesi. cube/cuboid【3要素】 length width height=multiplyother regular shapes(spheres…):look up the equation for the volume ii. liquidsmeasuring cylinder 量筒beaker 烧杯look at the scale horizontally and read the level of the bottom of the meniscus(简单表达：eyes level with the scale)用最合适的量筒。e.g. 你不能用5ml的量筒测10mliii. measure bu displacement (for irregular objects) 【6步】 select a cylinder 3 or 4 times bigger than the object fill in water note V1 immerse the object in the water note V2 Vobject=V2-V1 国际单位：SI units：metre（m)1l=1dm^3 1ml=1cm^31deci(dm): 0.1m 1centi(cm):0.01m1mili(mm):0.001m 1micro(um):0.000001m1kilo~(km):1000m 1.2 Density 公式：Density (ρ)=Mass (m)/Volume (V)做题时m和V两个要素缺一不可 SI units: kg/m^3 密度的性质：1）Gas&lt;solid/liquid2）任何在水面漂浮的物体密度都比水小。（e.g.冰）3）许多物质都有不同的密度（e.g.木头）4）水的密度：1*10^3kg/m^3, 1g/cm^35）immicible不溶中最上层的液体密度最小 1.3 Measuring Time 测量工具：analogue(指针）clockdigital(数字）clock (most precise） 测量方法：测量短时间：e.g.plumb bob单摆方法同1.1的2.1）相似 本章注意点 单位换算 各种物质的密度大小 特殊物体的m/v/ρ测量方法 读数 计算ρ=m/V Chapter 2 Describing Motion2.1 Understanding Speed 公式：Speed(average)(v)=Total Distance(s)/​Total Time(t) SI units: m/s Speed in the laboratorylight gate法1: start the timer: peg attached to the trolley breaks the beam of one of the light gate stop the timer: breaks the second timer法2： mount an interrupt card(遮光片) on the trolley start the timer: the leading edge of the interrupt card breaks the beam stop the timer: the trailing edge passed the gate 2.2 Distance-time Graphs注意看清楚横轴和纵轴 2.3 Understanding Acceleration 定义：acceleration: 加速度the rate at which its speed is changing/the change in speed per unit time 性质：vector矢量 e.g.velocityscalar标量 e.g.speed. (具体见3.6） 图像：speed-time graph the steeper the slope, the greater the acceleration a negative slope means a deceleration a horizontal graph(slope=0) meeans a constant speeddistance travelled=area under speed-time graph 2.4 Calculating Speed And Acceleration 公式：Acceleration (m/s)2=y2​−y1​​/x2​−x1​= Δv​/Δt 本章注意点 公式 实验（light gates） 图像的绘制，性质，相关计算 矢量和标量的区别（具体见3.6） Chapter 3 Forces And Motions3.1 We Have Lift-Off 牛顿（Newton)1N=举起一个苹果的力定义：the force required to give a mass of 1 kg an acceleration of 1 m/s^2 各种种类的力： 重力(gravity)—the weight 支持力(constant force)—-when two objects touch 摩擦力(friction)—opposes motion 空气/液体阻力(air resistance/drag) 浮力(upthrust) 力的性质&amp;合力：1）力有方向，大小，作用点2）力可以改变物体的速度和方向3）合力(resultant force):合力定义：the single force that has the same effect on a body as two or more forces合力性质：当合力为0时，物体没有加速度，并且物体保持静止或匀速直线运动合力判定：当物体物体没有加速度，并且物体保持静止或匀速直线运动，合力为0合力计算：注意合力有方向！triangle rule&amp;parallelogram rule(见3.6）注意位移 3.2 Mass, Weight and Gravity 重力(gravity)：定义：the force that exists between any two objects with mass方向：vertical downward the acceleration of free fall/acceleration due to gravity/gravitational field strength on Earth(g):g=9.8N/kg关于the acceleration of free fall和acceleration due to gravity和gravitational field strength的区别：the acceleration of free fall和acceleration due to gravity是一个东西，都是指地球上的ggravitational field strength指g，如果在后面加一个“on Earth”就是上面那两个东西的意思了 g的计算：gravitational field strength(g)=weight(W)/mass(m) weight和mass的区别:点击图片尽享高清以上图片取自物理八年级下教材解析 3.3 Falling And Turning terminal velocity: 终端速度 一个例子：跳伞运动员(parachutist)当他往下坠落的时候，一开始他的重力比空气阻力大，后来他的重力和阻力一样大，当他把伞打开时重力比阻力小，最后他的重力和阻力再次一样大。（速度时间图是一个长得像海啸的东西，参照IG书第50页） 圆周运动：【易错点】圆周运动中的加速度方向是从圆上一点指向圆心的一个箭头，一瞬间的运动方向是从圆上一点沿切线出去的一个箭头。（口诀：半径加速度，切线一瞬间）如何增加圆周中的合力：1）增加物体质量 2）增加物体速度 3）减小圆周半径 3.4 Force, Mass and Acceleration 公式：force=mass*accelerationF=ma 注意点：质量必须是kg单位，不是g，如果力是以N为单位。 3.5 Momentum 定义：momentum 动量：动量(是指国际单位制中的单位为kg·m/s ，量纲MLT⁻¹）表示为物体的质量和速度的乘积，是与物体的质量和速度相关的物理量，指的是运动物体的作用效果。动量也是矢量，它的方向与速度的方向相同。（摘自百度百科，有下划线字点开会跳转到对应的百度百科页面） 公式：1！！momentum=the quantity mass* velocityp=m*v（同样的公式可以被用来求m和v）2！！ impulse 冲量：impulse=the change in momentumimpulse=FΔt=Δ(mv)3！！ resultant force:resultant force=change in momentum/unit timeF=Δp/Δt=Δ(mv)/Δt the principle of the conservation of momentum:动量守恒定律the total momentum is constant and does not change because of an interaction between bodies(such as collisions撞击)total momentum before=total momentum after 3.6 More About Schalars and Vectors Schalars: 标量has magnitude onlyschalar quantities: distance, time, speed, mass, energy, temperature Vectors: 矢量has magnitude and directionvectors quantities: velocity, force, weight, acceleration, momentum, electric field strength, gravitational field strength 关于triangle rule：书上写的实际是vector triangle法。首先把两条力等比画出来（一定要等比，画完还要在下面标注一下比例尺度），用箭头表示清楚力的方向。然后把第一个力的箭尾和第二个力的箭头连起来，这条线就是合力了，一个三角形也出现了。把三角形成功画出来后，可以用直接测量法，也可以用勾股定理(Pythagoras’ Theorem)。 本章注意点 合力的计算 矢量和标量 force, momentum等的公式","categories":[{"name":"IGCSE","slug":"IGCSE","permalink":"https://olivezq.github.io/categories/IGCSE/"}],"tags":[{"name":"Physics","slug":"Physics","permalink":"https://olivezq.github.io/tags/Physics/"}]},{"title":"My NEC DR Experience","slug":"My-NEC-DR-Experience","date":"2021-12-25T03:28:03.000Z","updated":"2021-12-25T03:41:31.296Z","comments":true,"path":"2021/12/25/My-NEC-DR-Experience/","link":"","permalink":"https://olivezq.github.io/2021/12/25/My-NEC-DR-Experience/","excerpt":"","text":"My NEC DR Experience Winter VocationThe story began before I go to high school.By accident, I met one of my new classmates who became our team leader in the end, and soon agreed to join his NEC team. At that time, I thought this was only one of the common things that I have to experience during high school, but I was wrong. It clearly brought me unique practical knowledge and feelings that no other incident can. LessonsNEC, short for National Economics Competition, is divided into three levels to choose from. The easiest level, suitable for PAL students like us, is called PRE. For students in AS and A2, they are asked to take higher levels, DR and AS, while AS the most difficult.Sonic, our leader, told us that his teacher advised him to compete DR. I was surprised at first because we had never studied Economics before, but I still accepted that option without giving it much thought.We soon regret. Everyone else in PAL signed for PRE and people who would compete with us were all from higher grades. But with much courage, we decided to try our best.Well, he who knows not fears not.To catch up our Economics, we attended several NEC courses outside school. We also joined our school’s Economics Club to receive further education.I always remember those nights. When everyone got their schoolbags and left the classroom, the three of us would travel far away to a plaza to study Economics, Sonic, Kevin and me. Crowded in a small room, where we learn about absolute advantages, tariffs, quotas, inflation and things like that. We learned both micro and macro at the same time, sometimes even international and current events, because we didn’t have time left.Those nights, after the lesson, I would leaned against the bus’s window, watching the streetlights passing. Thinking about the future which seemed to be so unclear. The Preliminary TestWe found the fourth teammate online. After all the preparation, the test was imminent, and we were more nervous than ever before.I double checked my computer’s camera which was working well and spent the whole Saturday and Sunday preparinng. Before the competition, my teammates sent several encouraging messages both to me and in the group which was touching.The test ended like it was no more than a normal test. Then we had another week waiting for our results anxiously. Results“Is the results coming out today?” I asked.Getting an affirmative answer, I took a deep breath.In the afternoon, when I was working on my GitHub, Sonic texted me in an urgent tone. Then I clicked on the “Bloom” icon, and saw the Chinese characters of “rise in rank”, red and big.It took me a while to realize what had just happended. I then thousands checked the results, clicking the “see results” icon again and again. My teammates exclaimed their joy in almost every social media, and the next few hours my computer was busy in replying congradulation messages.It was so unbelievable. So, so, so, unbelievable.We competed with people older than us, and we managed to win out more than a half of them. All beacause of our supportive parents, our respected teachers, and every hardworking member in our team.Our next stop would be Changsha, Hunan in March.And I think, the future is bright.Boom like a TNT.As Sonic claimed in our group’s description.","categories":[{"name":"Life","slug":"Life","permalink":"https://olivezq.github.io/categories/Life/"}],"tags":[{"name":"Experience","slug":"Experience","permalink":"https://olivezq.github.io/tags/Experience/"},{"name":"Economics","slug":"Economics","permalink":"https://olivezq.github.io/tags/Economics/"},{"name":"NEC","slug":"NEC","permalink":"https://olivezq.github.io/tags/NEC/"}]},{"title":"good morning your honor","slug":"demo","date":"2021-12-24T02:47:40.000Z","updated":"2021-12-30T13:02:12.796Z","comments":true,"path":"2021/12/24/demo/","link":"","permalink":"https://olivezq.github.io/2021/12/24/demo/","excerpt":"","text":"Yet this is a test.GOOD MORNING YOUR HONOR!","categories":[],"tags":[{"name":"demo","slug":"demo","permalink":"https://olivezq.github.io/tags/demo/"},{"name":"测试","slug":"测试","permalink":"https://olivezq.github.io/tags/%E6%B5%8B%E8%AF%95/"}]}],"categories":[{"name":"IGCSE","slug":"IGCSE","permalink":"https://olivezq.github.io/categories/IGCSE/"},{"name":"Rationality","slug":"Rationality","permalink":"https://olivezq.github.io/categories/Rationality/"},{"name":"Life","slug":"Life","permalink":"https://olivezq.github.io/categories/Life/"}],"tags":[{"name":"Extended Math","slug":"Extended-Math","permalink":"https://olivezq.github.io/tags/Extended-Math/"},{"name":"Practical","slug":"Practical","permalink":"https://olivezq.github.io/tags/Practical/"},{"name":"Translation","slug":"Translation","permalink":"https://olivezq.github.io/tags/Translation/"},{"name":"Productivity","slug":"Productivity","permalink":"https://olivezq.github.io/tags/Productivity/"},{"name":"Life improvements","slug":"Life-improvements","permalink":"https://olivezq.github.io/tags/Life-improvements/"},{"name":"2021","slug":"2021","permalink":"https://olivezq.github.io/tags/2021/"},{"name":"Experience","slug":"Experience","permalink":"https://olivezq.github.io/tags/Experience/"},{"name":"Summary","slug":"Summary","permalink":"https://olivezq.github.io/tags/Summary/"},{"name":"Physics","slug":"Physics","permalink":"https://olivezq.github.io/tags/Physics/"},{"name":"Economics","slug":"Economics","permalink":"https://olivezq.github.io/tags/Economics/"},{"name":"NEC","slug":"NEC","permalink":"https://olivezq.github.io/tags/NEC/"},{"name":"demo","slug":"demo","permalink":"https://olivezq.github.io/tags/demo/"},{"name":"测试","slug":"测试","permalink":"https://olivezq.github.io/tags/%E6%B5%8B%E8%AF%95/"}]}